In [36]:
from pandas import DataFrame, Series
import pandas as pd

In [2]:
student_map = {
    'Name': ['mehul', 'jane', 'jill'],
    'Roll': [10, 23, 11],
    'Physics': [99, 96, 90],
    'Chemistry': [93, 95, 87]
}

In [3]:
d1 = DataFrame(student_map)
d1

    Name  Roll  Physics  Chemistry
0  mehul    10       99         93
1   jane    23       96         95
2   jill    11       90         87

In [4]:
d2 = DataFrame(student_map, index=student_map['Roll'])
d2

     Name  Roll  Physics  Chemistry
10  mehul    10       99         93
23   jane    23       96         95
11   jill    11       90         87

In [5]:
d3 = DataFrame(student_map, index=student_map['Roll'], columns=['Name', 'Physics', 'Chemistry'])
d3

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       96         95
11   jill       90         87

In [7]:
print(d3.index)
print(d3.columns)

Int64Index([10, 23, 11], dtype='int64')
Index(['Name', 'Physics', 'Chemistry'], dtype='object')

In [11]:
# indexing
# explicit index - (rows + columns)
print(d3.loc[10])
print(d3.loc[[10, 11]])

print(d3.loc[[10, 11], 'Name'])
print(d3.loc[[23, 11], ['Name', 'Chemistry']])

Name         mehul
Physics         99
Chemistry       93
Name: 10, dtype: object
     Name  Physics  Chemistry
10  mehul       99         93
11   jill       90         87
10    mehul
11     jill
Name: Name, dtype: object
    Name  Chemistry
23  jane         95
11  jill         87

In [14]:
# indexing
# implicit index (rows + columns)
print(d3.iloc[0])
print(d3.iloc[[0, -1]])

print(d3.iloc[[0, -1], [0, -1]])

Name         mehul
Physics         99
Chemistry       93
Name: 10, dtype: object
     Name  Physics  Chemistry
10  mehul       99         93
11   jill       90         87
     Name  Chemistry
10  mehul         93
11   jill         87

In [17]:
# slicing
print(d3)
print(d3.iloc[:2])
print(d3.iloc[-2:, 1:])

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       96         95
11   jill       90         87
     Name  Physics  Chemistry
10  mehul       99         93
23   jane       96         95
    Physics  Chemistry
23       96         95
11       90         87

In [19]:
# indexing + slicing
print(d3.loc[[10, 11], 'Physics':'Chemistry'])

    Physics  Chemistry
10       99         93
11       90         87

In [20]:
print(d3.iloc[[0, -1], 1:])

    Physics  Chemistry
10       99         93
11       90         87

In [23]:
# column indexing
print(d3)
print(d3['Physics'])
print(d3[['Physics', 'Chemistry']])

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       96         95
11   jill       90         87
10    99
23    96
11    90
Name: Physics, dtype: int64
    Physics  Chemistry
10       99         93
23       96         95
11       90         87

In [26]:
print(d3)
s1 = Series({23: 100, 11: 94, 10: 89})
print(s1)

     Name  Physics  Chemistry
10  mehul       99         93
23   jane       96         95
11   jill       90         87
23    100
11     94
10     89
dtype: int64

In [27]:
d3['Maths'] = s1
d3

     Name  Physics  Chemistry  Maths
10  mehul       99         93     89
23   jane       96         95    100
11   jill       90         87     94

In [28]:
d3['Total'] = d3['Physics'] + d3['Chemistry'] + d3['Maths']
d3

     Name  Physics  Chemistry  Maths  Total
10  mehul       99         93     89    281
23   jane       96         95    100    291
11   jill       90         87     94    271

In [29]:
d4 = d3[['Physics', 'Chemistry', 'Maths']]
d4

    Physics  Chemistry  Maths
10       99         93     89
23       96         95    100
11       90         87     94

In [30]:
d4.mean(axis=0)

Physics      95.000000
Chemistry    91.666667
Maths        94.333333
dtype: float64

In [31]:
d4.sum(axis=1)

10    281
23    291
11    271
dtype: int64

In [33]:
print(d3)
d5 = d3.drop(columns=['Total'])
d5

     Name  Physics  Chemistry  Maths  Total
10  mehul       99         93     89    281
23   jane       96         95    100    291
11   jill       90         87     94    271

     Name  Physics  Chemistry  Maths
10  mehul       99         93     89
23   jane       96         95    100
11   jill       90         87     94

In [35]:
d6 = DataFrame({
    'Verbal': [100, 90, 80],
    'Quant': [90, 98, 99]
}, index=[11, 10, 23])
d6

    Verbal  Quant
11     100     90
10      90     98
23      80     99

In [38]:
pd.merge(d5, d6, left_index=True, right_index=True)

     Name  Physics  Chemistry  Maths  Verbal  Quant
10  mehul       99         93     89      90     98
23   jane       96         95    100      80     99
11   jill       90         87     94     100     90

In [41]:
print(d6)
d6.sort_values(by='Verbal', ascending=False)

    Verbal  Quant
11     100     90
10      90     98
23      80     99

    Verbal  Quant
11     100     90
10      90     98
23      80     99